In [25]:
import pandas as pd
df = pd.read_csv('car-sales-data.csv')

In [26]:
df.isnull().sum()

Make        1
Colour      1
Odometer    4
Doors       1
Price       2
dtype: int64

In [27]:
df['Price'] = df['Price'].str.replace('$', '').str.replace(',', '')
df['Price'] = df['Price'].astype('float64')

In [28]:
df['Odometer'] = df['Odometer'].fillna(df['Odometer'].median())
df['Price'] = df['Price'].fillna(df['Price'].median())

df

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   4000.0
1   Honda    Red   87899.0    4.0   5000.0
2  Toyota   Blue   73949.5    3.0   7000.0
3     BMW  Black   11179.0    5.0  22000.0
4  Nissan  White  213095.0    4.0   3500.0
5  Toyota  Green   73949.5    4.0   4500.0
6   Honda    NaN   73949.5    4.0   7500.0
7   Honda   Blue   73949.5    4.0   6000.0
8  Toyota  White   60000.0    NaN   6000.0
9     NaN  White   31600.0    4.0   9700.0

### 1. Chiếc xe nào được bán với giá đắt nhất?

In [29]:
df.loc[df['Price'] == df['Price'].max()]

  Make Colour  Odometer  Doors    Price
3  BMW  Black   11179.0    5.0  22000.0

### 2. Hãng xe nào có chiếc xe với giá trên mỗi kilomet đã đi được rẻ nhất?

In [30]:
df.loc[df['Odometer'] == df['Odometer'].min()].Make

3    BMW
Name: Make, dtype: object

### 3. Trung bình giá xe của các hãng xe là bao nhiêu? Hãng xe nào có trung bình giá bán cao nhất?

In [39]:
mean_by_make = df.groupby('Make', as_index=False)['Price'].mean()
mean_by_make

     Make         Price
0     BMW  22000.000000
1   Honda   6166.666667
2  Nissan   3500.000000
3  Toyota   5375.000000

In [40]:
mean_by_make.nlargest(1, 'Price')

  Make    Price
0  BMW  22000.0